In [12]:
# Importing pandas library
import pandas as pd

In [13]:
# Importing the dataset
df = pd.read_csv('Octane.csv')
df.head()

   Sample  Material1  Material2  Material3  Condition  Octane
0       1      55.33       1.72         54    1.66219   92.19
1       2      59.13       1.20         53    1.58399   92.74
2       3      57.39       1.42         55    1.61731   91.88
3       4      56.43       1.78         55    1.66228   92.80
4       5      55.98       1.58         54    1.63195   92.56

In [14]:
# Filtering out the rows having Octane value greater than 93
df.loc[df.Octane > 93]

    Sample  Material1  Material2  Material3  Condition  Octane
70      71      49.14       0.00         40    2.17140   94.17
71      72      49.10       0.00         42    2.31909   94.39
72      73      44.66       4.99         42    2.14314   93.42
73      74      44.64       3.73         44    2.08081   94.65
74      75       4.23      10.76         41    2.17070   97.61
75      76       5.53       7.99         40    1.99418   97.08
76      77      17.11       5.06         47    1.61437   95.12

In [15]:
# Filtering out rows with multiple conditions on multiple columns
df.loc[(df.Octane > 93) & (df.Material1 > 44)]

    Sample  Material1  Material2  Material3  Condition  Octane
70      71      49.14       0.00         40    2.17140   94.17
71      72      49.10       0.00         42    2.31909   94.39
72      73      44.66       4.99         42    2.14314   93.42
73      74      44.64       3.73         44    2.08081   94.65

In [16]:
# Slicing the data (Getting rows with index 1 to 3)
df.loc[1:3]

   Sample  Material1  Material2  Material3  Condition  Octane
1       2      59.13       1.20         53    1.58399   92.74
2       3      57.39       1.42         55    1.61731   91.88
3       4      56.43       1.78         55    1.66228   92.80

In [17]:
# Updating the value at certain field using loc
df.loc[(df.Condition > 2) & (df.Material1 > 44), ['Octane']] = 93
df.loc[(df.Condition > 2) & (df.Material1 > 44), ['Octane']]

    Octane
49    93.0
70    93.0
71    93.0
72    93.0
73    93.0

In [18]:
# Datetime Manipulation

In [19]:
# Creating a date range
from datetime import datetime
date_range = pd.date_range(start ='1/1/2022', end ='1/08/2022', freq ='Min')
print(date_range)

DatetimeIndex(['2022-01-01 00:00:00', '2022-01-01 00:01:00',
               '2022-01-01 00:02:00', '2022-01-01 00:03:00',
               '2022-01-01 00:04:00', '2022-01-01 00:05:00',
               '2022-01-01 00:06:00', '2022-01-01 00:07:00',
               '2022-01-01 00:08:00', '2022-01-01 00:09:00',
               ...
               '2022-01-07 23:51:00', '2022-01-07 23:52:00',
               '2022-01-07 23:53:00', '2022-01-07 23:54:00',
               '2022-01-07 23:55:00', '2022-01-07 23:56:00',
               '2022-01-07 23:57:00', '2022-01-07 23:58:00',
               '2022-01-07 23:59:00', '2022-01-08 00:00:00'],
              dtype='datetime64[ns]', length=10081, freq='T')

In [20]:
# Creating the timestamp
ts = pd.Timestamp('01-11-2022')
# Print the timestamp
print(ts)

2022-01-11 00:00:00

In [21]:
# importing pandas as pd
import pandas as pd

# Creating a dataframe
df = pd.DataFrame({'State':['Maharashtra', 'Karnataka', 'Kerela', 'Punjab'],
                    'Events':['Election Rally', 'Local Cinema', 'Tourist Season', 'Harvesting'],
                    'Cost':[10000, 5000, 15000, 2000]})


# Creating timestamp indexes
index_ = [pd.Timestamp('01-06-2018'), pd.Timestamp('04-06-2018'),
        pd.Timestamp('07-06-2018'), pd.Timestamp('10-06-2018')]

# Setting timestamp index
df.index = index_

# Output
print('Output :\n', df)

Output :
                   State          Events   Cost
2018-01-06  Maharashtra  Election Rally  10000
2018-04-06    Karnataka    Local Cinema   5000
2018-07-06       Kerela  Tourist Season  15000
2018-10-06       Punjab      Harvesting   2000

In [22]:
# Checking the type
print(type(df.index))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>